app/views/owners/show.html.erb

SELECT "pets".* FROM "pets" WHERE "pets"."owner_id" = ?  [["owner_id", 1]]
---
Pets:
<%@owner.pets.each do |pet|%>