app/controllers/owners_controller.rb

  def show
    @owner = Owner.find(params[:id])
---
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    owner = Owner.create(owner_params)
---
INSERT INTO "owners" ("first_name", "last_name", "age", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Nick"], ["last_name", "Shao"], ["age", 22], ["email", "nick@gmail.com"], ["created_at", "2019-06-06 20:46:03.296317"], ["updated_at", "2019-06-06 20:46:03.296317"]]

  def edit
    @owner = Owner.find(params[:id])
---
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    owner = Owner.find(params[:id])
    owner.update(owner_params)
---
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "owners" SET "first_name" = ?, "last_name" = ?, "age" = ?, "email" = ?, "updated_at" = ? WHERE "owners"."id" = ?  [["first_name", "ScHoolboy"], ["last_name", "Q"], ["age", 36], ["email", "q@gmail.com"], ["updated_at", "2019-06-06 21:15:55.931851"], ["id", 5]]

  def destroy
    owner = Owner.find(params[:id])
    owner.delete
---
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "owners" WHERE "owners"."id" = ?  [["id", 6]]

  def many
    @owners = Owner.all.select{|owner| owner.pets.count >= 2}
---
SELECT "owners".* FROM "owners"
SELECT COUNT(*) FROM "pets" WHERE "pets"."owner_id" = ?  [["owner_id", 1]]