app/controllers/pets_controller.rb

SELECT "owners".* FROM "owners"
---
  def new
    @owners = Owner.all

INSERT INTO "pets" ("name", "category", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Carl"], ["category", "bird"], ["owner_id", 3], ["created_at", "2019-06-06 20:47:47.952167"], ["updated_at", "2019-06-06 20:47:47.952167"]]
---
  def create
    pet = Pet.create(pet_params)

SELECT "owners".* FROM "owners"
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @owners = Owner.all
    @pet = Pet.find(params[:id])

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "pets" SET "name" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["name", "Maddie"], ["updated_at", "2019-06-07 00:21:11.224558"], ["id", 9]]
---
  def update
    pet = Pet.find(params[:id])
    pet.update(pet_params)

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "pets" WHERE "pets"."id" = ?  [["id", 7]]
---
  def destroy
    pet = Pet.find(params[:id])
    pet.delete